delete from tbl_syskanri where kanricd = '5110' ;
delete from tbl_syskanri where kanricd = '5111' and kbncd = '15' and styukymd = '00000000' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '15' and styukymd = '00000000' and edyukymd = '20080331';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20040401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20040401' and edyukymd = '20080331';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20080401' and edyukymd = '20080331';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '52' and styukymd = '20080401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '53' and styukymd = '20080401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '54' and styukymd = '20080401' and edyukymd = '99999999';   


COPY tbl_syskanri (kanricd, kbncd, styukymd, edyukymd, kanritbl, termid, opid, creymd, upymd, uphms, hospnum) FROM stdin;
5110	01      	00000000	20080331	190111110¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£±                                        ¾®Æş´É£±			        	        	      	1
5110	01      	20080401	99999999	190111110¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£²                                        ¾®Æş´É£²			        	        	      	1
5110	02      	00000000	20080331	190111210¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£²                                        ¾®Æş´É£²			        	        	      	1
5110	02      	20080401	99999999	190111210¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£³                                        ¾®Æş´É£³			        	        	      	1
5110	03      	00000000	20080331	190055210ÆÃ¼ì¼À´µÎÅÍÜÉÂÅïÆş±¡ÎÁ£±                                    ÆÃ¼ìÎÅÍÜ£±			        	        	      	1
5110	03      	20080401	99999999	190055210ÆÃ¼ì¼À´µÉÂÅïÆş±¡ÎÁ£±                                        ÆÃ¼ì¼À´µ£±			        	        	      	1
5110	04      	00000000	20080331	190055310ÆÃ¼ì¼À´µÎÅÍÜÉÂÅïÆş±¡ÎÁ£²                                    ÆÃ¼ìÎÅÍÜ£²			        	        	      	1
5110	04      	20080401	99999999	190055310ÆÃ¼ì¼À´µÉÂÅïÆş±¡ÎÁ£²                                        ÆÃ¼ì¼À´µ£²			        	        	      	1
5110	05      	00000000	20040331	190739910Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µ¼£ÎÅÉÂÅïÆş±¡ÎÁ                              Ï·Ç§ÃÎ			        	        	      	1
5110	06      	00000000	20060331	190740110Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µÎÅÍÜÉÂÅïÆş±¡ÎÁ                              Ï·Ç§ÎÅ			        	        	      	1
5110	07      	00000000	20060331	190055010Àº¿ÀÎÅÍÜÉÂÅïÆş±¡ÎÁ£±                                        Àº¿ÀÎÅÍÜ£±			        	        	      	1
5110	07      	20060401	99999999	190055010Àº¿ÀÎÅÍÜÉÂÅïÆş±¡ÎÁ                                          Àº¿ÀÎÅÍÜ			        	        	      	1
5110	08      	00000000	20060331	190055110Àº¿ÀÎÅÍÜÉÂÅïÆş±¡ÎÁ£²                                        Àº¿ÀÎÅÍÜ£²			        	        	      	1
5110	09      	00000000	99999999	190028910´ËÏÂ¥±¥¢ÉÂÅïÆş±¡ÎÁ                                          ´ËÏÂ¥±¥¢			        	        	      	1
5110	10      	00000000	20080331	190111410Àº¿À²ÊµßµŞÆş±¡ÎÁ                                            Àº¿ÀµßµŞ			        	        	      	1
5110	10      	20080401	99999999	190111410Àº¿À²ÊµßµŞÆş±¡ÎÁ£±                                          Àº¿ÀµßµŞ£±			        	        	      	1
5110	11      	00000000	99999999	190066910Àº¿À²ÊµŞÀ­´ü¼£ÎÅÉÂÅïÆş±¡ÎÁ£±                                Àº¿ÀµŞÀ­£±			        	        	      	1
5110	12      	00000000	99999999	190067010Àº¿À²ÊµŞÀ­´ü¼£ÎÅÉÂÅïÆş±¡ÎÁ£²                                Àº¿ÀµŞÀ­£²			        	        	      	1
5110	13      	00000000	20080930	190075910²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï                                ²óÉü´ü¥ê¥Ï			        	        	      	1
5110	14      	00000000	20080331	190075810¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£³                                        ¾®Æş´É£³			        	        	      	1
5110	14      	20080401	99999999	190075810¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£´                                        ¾®Æş´É£´			        	        	      	1
5110	16      	20061001	20080930	190124910²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï¡ÊÀ¸³èÎÅÍÜ¡Ë                    ²óÉü´ü¥ê¥Ï¡ÊÀ¸³èÎÅÍÜ¡Ë  1			        	        	      	1
5110	17      	20080401	99999999	190129310¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£±                                        ¾®Æş´É£±			        	        	      	1
5110	18      	20080401	99999999	190129410²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï£±                              ²óÉü´ü¥ê¥Ï£±			        	        	      	1
5110	19      	20080401	99999999	190129510²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï£±¡ÊÀ¸³èÎÅÍÜ¡Ë                  ²óÉü´ü¥ê¥Ï£±¡ÊÀ¸³èÎÅÍÜ¡Ë1			        	        	      	1
5110	20      	20080401	99999999	190129610²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï£²                              ²óÉü´ü¥ê¥Ï£²			        	        	      	1
5110	21      	20080401	99999999	190129710²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÉÂÅï£²¡ÊÀ¸³èÎÅÍÜ¡Ë                  ²óÉü´ü¥ê¥Ï£²¡ÊÀ¸³èÎÅÍÜ¡Ë1			        	        	      	1
5110	22      	20080401	99999999	190130010Àº¿À²ÊµßµŞÆş±¡ÎÁ£²                                          Àº¿ÀµßµŞ£²			        	        	      	1
5110	23      	20080401	99999999	190130210Àº¿À²ÊµßµŞ¡¦¹çÊ»¾ÉÆş±¡ÎÁ                                    Àº¿ÀµßµŞ¡¦¹çÊ»¾É			        	        	      	1
5110	05      	20040401	20080331	190739910Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µ¼£ÎÅÉÂÅïÆş±¡ÎÁ£±        Ï·Ç§ÃÎ£±			        	        	      	1
5110	05      	20080401	99999999	190739910Ç§ÃÎ¾ÉÉÂÅïÆş±¡ÎÁ£±                      Ç§ÃÎ£±			        	        	      	1
5110	15      	20040401	20080331	190813410Ï·¿ÍÀ­Ç§ÃÎ¾É¼À´µ¼£ÎÅÉÂÅïÆş±¡ÎÁ£²        Ï·Ç§ÃÎ£²			        	        	      	1
5110	15      	20080401	99999999	190813410Ç§ÃÎ¾ÉÉÂÅïÆş±¡ÎÁ£²                      Ç§ÃÎ£²			        	        	      	1
5111	15      	00000000	20080331	190788810Ï·¿Í°ìÈÌÉÂÅïÆş±¡°åÎÅ´ÉÍıÎÁ                                  Ï·Æş´É                  01			        	        	      	1
5111	18      	20040401	20080331	190117410°¡µŞÀ­´üÆş±¡°åÎÅ´ÉÍıÎÁ                                      °¡µŞÀ­´ü                01			        	        	      	1
5111	18      	20080401	20080331	190117410°¡µŞÀ­´üÆş±¡°åÎÅ´ÉÍıÎÁ£±                                    °¡µŞÀ­´ü£±              01			        	        	      	1
5111	52      	20080401	99999999	190130410Ã»´üÂÚºß¼ê½Ñ´ğËÜÎÁ£³                                        Ã»´üÂÚºß£³              02			        	        	      	1
5111	53      	20080401	99999999	190130510Ã»´üÂÚºß¼ê½Ñ´ğËÜÎÁ£³¡ÊÀ¸³èÎÅÍÜ¡Ë                            Ã»´üÂÚºß£³¡ÊÀ¸³èÎÅÍÜ¡Ë  021			        	        	      	1
5111	54      	20080401	99999999	190130210°¡µŞÀ­´üÆş±¡°åÎÅ´ÉÍıÎÁ£²                                    °¡µŞÀ­´ü£²              01			        	        	      	1
\.
