delete from tbl_syskanri where kanricd = '5110' ;
delete from tbl_syskanri where kanricd = '5111' and kbncd = '15' and styukymd = '00000000' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20040401' and edyukymd = '99999999';

COPY tbl_syskanri (kanricd, kbncd, styukymd, edyukymd, kanritbl, termid, opid, creymd, upymd, uphms, hospnum) FROM stdin;
5110	01      	00000000	20080331	190111110小児入院医療管理料１                                        小入管１			        	        	      	1
5110	01      	20080401	99999999	190111110小児入院医療管理料２                                        小入管２			        	        	      	1
5110	02      	00000000	20080331	190111210小児入院医療管理料２                                        小入管２			        	        	      	1
5110	02      	20080401	99999999	190111210小児入院医療管理料３                                        小入管３			        	        	      	1
5110	03      	00000000	20080331	190055210特殊疾患療養病棟入院料１                                    特殊療養１			        	        	      	1
5110	03      	20080401	99999999	190055210特殊疾患病棟入院料１                                        特殊疾患１			        	        	      	1
5110	04      	00000000	20080331	190055310特殊疾患療養病棟入院料２                                    特殊療養２			        	        	      	1
5110	04      	20080401	99999999	190055310特殊疾患病棟入院料２                                        特殊疾患２			        	        	      	1
5110	05      	00000000	20040331	190739910老人性認知症疾患治療病棟入院料                              老認知			        	        	      	1
5110	05      	20040401	99999999	190739910老人性認知症疾患治療病棟入院料１                            老認知１			        	        	      	1
5110	06      	00000000	20060331	190740110老人性認知症疾患療養病棟入院料                              老認療			        	        	      	1
5110	07      	00000000	20060331	190055010精神療養病棟入院料１                                        精神療養１			        	        	      	1
5110	07      	20060401	99999999	190055010精神療養病棟入院料                                          精神療養			        	        	      	1
5110	08      	00000000	20060331	190055110精神療養病棟入院料２                                        精神療養２			        	        	      	1
5110	09      	00000000	99999999	190028910緩和ケア病棟入院料                                          緩和ケア			        	        	      	1
5110	10      	00000000	20080331	190111410精神科救急入院料                                            精神救急			        	        	      	1
5110	10      	20080401	99999999	190111410精神科救急入院料１                                          精神救急１			        	        	      	1
5110	11      	00000000	99999999	190066910精神科急性期治療病棟入院料１                                精神急性１			        	        	      	1
5110	12      	00000000	99999999	190067010精神科急性期治療病棟入院料２                                精神急性２			        	        	      	1
5110	13      	00000000	20080930	190075910回復期リハビリテーション病棟                                回復期リハ			        	        	      	1
5110	14      	00000000	20080331	190075810小児入院医療管理料３                                        小入管３			        	        	      	1
5110	14      	20080401	99999999	190075810小児入院医療管理料４                                        小入管４			        	        	      	1
5110	15      	20040401	99999999	190813410老人性認知症疾患治療病棟入院料２                            老認知２			        	        	      	1
5110	16      	20061001	20080930	190124910回復期リハビリテーション病棟（生活療養）                    回復期リハ（生活療養）  1			        	        	      	1
5110	17      	20080401	99999999	190129310小児入院医療管理料１                                        小入管１			        	        	      	1
5110	18      	20080401	99999999	190129410回復期リハビリテーション病棟１                              回復期リハ１			        	        	      	1
5110	19      	20080401	99999999	190129510回復期リハビリテーション病棟１（生活療養）                  回復期リハ１（生活療養）1			        	        	      	1
5110	20      	20080401	99999999	190129610回復期リハビリテーション病棟２                              回復期リハ２			        	        	      	1
5110	21      	20080401	99999999	190129710回復期リハビリテーション病棟２（生活療養）                  回復期リハ２（生活療養）1			        	        	      	1
5110	22      	20080401	99999999	190130010精神科救急入院料２                                          精神救急２			        	        	      	1
5110	23      	20080401	99999999	190130210精神科救急・合併症入院料                                    精神救急・合併症			        	        	      	1
5111	15      	00000000	20080331	190788810老人一般病棟入院医療管理料                                  老入管                  01			        	        	      	1
5111	18      	20040401	20080331	190117410亜急性期入院医療管理料                                      亜急性期                01			        	        	      	1
5111	18      	20080401	20080331	190117410亜急性期入院医療管理料１                                    亜急性期１              01			        	        	      	1
5111	52      	20080401	99999999	190130410短期滞在手術基本料３                                        短期滞在３              02			        	        	      	1
5111	53      	20080401	99999999	190130510短期滞在手術基本料３（生活療養）                            短期滞在３（生活療養）  021			        	        	      	1
5111	54      	20080401	99999999	190130210亜急性期入院医療管理料２                                    亜急性期２              01			        	        	      	1
\.
