      *******************************************************************
      * Project code name "ORCA"
      * 楠��4W?激Zプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *    api01rv2　（ＡＰＩ情報取得）
      ******************************************************************
      *ORAPI012R1V2
           COPY    "CPAPIPTAV2.INC".
      *ORAPI011R1V2
           COPY    "CPAPILSTV2.INC".
      *ORAPI014R1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST1-//.
      *ORAPI012R2V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST2-//.
      *ORAPI012R3V2
           COPY    "CPAPILSTV2.INC"  REPLACING
                                     //APILST-// BY //APILST3-//.
      *ORAPI012R4V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST4-//.
      *ORAPI101R1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST5-//.
      *ORAPI021R1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST6-//.
      *ORAPI022R1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                     //APILST-// BY //APILST7-//.
      *ORAPI014R2V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST8-//.
      *ORAPI023R1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST9-//.
      *ORAPI021R2V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST10-//.
      *ORAPI031RC1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST11-//.
      *ORAPI031RC2V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST12-//.
      *ORAPI021R3V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST13-//.
      *
