      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------------*
      *    一般名例外コードテーブル COPY (CMGENERICTBL.INC)
      *----------------------------------------------------------------*
      *****************************************************************
      *  コピー句修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      *****************************************************************
      *
       01  TBL-GENERIC-CODE-AREA.
      *
           03  FILLER  PIC X(25)   VALUE  "2171014N1029 2171014NAZZZ".
           03  FILLER  PIC X(25)   VALUE  "3179107M1059 3179107MAZZZ".
           03  FILLER  PIC X(25)   VALUE  "1315701Q3033 1315701QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "1315701Q3076 1315701QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "1315701Q3092 1315701QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "1315701Q3084 1315701QBZZZ".
           03  FILLER  PIC X(25)   VALUE  "1315701Q4048 1315701QBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1095 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1109 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1117 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1125 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1133 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S1141 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S2083 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2171700S2091 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3020 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3038 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3054 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3070 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3097 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3100 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3119 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3127 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3135 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3143 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3151 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3160 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3194 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3208 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3216 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q3224 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q5022 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q5030 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2619702Q5049 2619702QAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1146 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1154 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1162 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1170 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1189 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649729S1197 2649729SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1135 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1143 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1160 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1186 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1208 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1216 2649731SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1127 2649731SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1151 2649731SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1178 2649731SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1194 2649731SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1232 2649731SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S3043 2649732SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S3051 2649732SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S3060 2649732SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S4031 2649732SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S1148 2649732SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S1172 2649732SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S2047 2649732SBZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649732S2055 2649732SBZZZ".
      *H24.12
           03  FILLER  PIC X(25)   VALUE  "2171700S1150 2171700SAZZZ".
           03  FILLER  PIC X(25)   VALUE  "2649731S1259 2649731SAZZZ".
      *
       01  TBL-GENERIC-CODE-AREA-R REDEFINES   TBL-GENERIC-CODE-AREA.
     ***** 03  TBL-GENERIC-OCC     OCCURS  59  INDEXED   TBL-GEN.
           03  TBL-GENERIC-OCC     OCCURS  61  INDEXED   TBL-GEN.
               05  TBL-YAKKAKJNCD          PIC X(12).
               05  TBL-YOBI1               PIC X(01).
               05  TBL-GENERIC-CODE        PIC X(12).
      *
