      ************************************************************
      *    未収金一覧用収納明細           COPY (CPBD003.INC)     *
      ************************************************************
      ************************************************************
      *  コピー句修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      ************************************************************
      *01  BD003-REC.
           03  BD003-KEY.
      *医療機関ＩＤ
               05  BD003-HOSPID        PIC  X(24).
      *入外区分
               05  BD003-NYUGAIKBN     PIC  X(01).
      *患者ＩＤ
               05  BD003-PTID          PIC  9(10).
      *伝票番号
               05  BD003-DENPNUM       PIC  9(07).
      *伝票番号枝番
               05  BD003-DENPEDANUM    PIC  9(02).
      *請求金額
           03  BD003-SKYMONEY          PIC S9(10).
      *入返金額
           03  BD003-NYUHEN-MONEY      PIC S9(10).
      *入返金日
           03  BD003-NYUHEN-YMD        PIC  X(08).
      *診療日
           03  BD003-SRYYMD            PIC  X(08).
