      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this licence along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------------*
      *    ¥ª¥ó¥é¥¤¥óÄ¢É¼°õºþ¥µ¥Ö                                      *
      *----------------------------------------------------------------*
      *****************************************************************
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *****************************************************************
       01  ORCSMKPRTAREA.
      *    £Ó£È£Å£Ì£ÌÌ¾
           03  MKPRT-ID                 PIC  X(20).
      *    Ä¢É¼Ì¾
           03  MKPRT-DIA                PIC  X(50).
      *    £Ä£Å£ÆÌ¾
           03  MKPRT-DEF                PIC  X(50).
      *    ¥Ç¡¼¥¿ÆâÍÆ
           03  MKPRT-DAT                PIC  X(90).
      *    °õºþ°ÌÃÖ
           03  MKPRT-PRTNM              PIC  X(16).
      *
      *    Éüµ¢¥³¡¼¥É
           03  MKPRT-RC                 PIC  9(04).
      *
