      * 01  TOUKEICSV-H-REC.
            03  TOUKEICSV-H-KEY.
                05  TOUKEICSV-H-HOSPNUM    PIC 9(2).
                05  TOUKEICSV-H-TBL-KEY    PIC X(8).
                05  TOUKEICSV-H-RENNUM     PIC 9(4).
                05  TOUKEICSV-H-TBL-GROUP  PIC X(14).
                05  TOUKEICSV-H-SHORI-RENNUM
                                           PIC 9(4).
            03  TOUKEICSV-H-SHELLID    PIC X(20).
            03  TOUKEICSV-H-SRYYM      PIC X(6).
            03  TOUKEICSV-H-SRYYMD     PIC X(8).
            03  TOUKEICSV-H-CNT        PIC 9(5).
            03  TOUKEICSV-H-NYUGAIKBN  PIC X(1).
            03  TOUKEICSV-H-TO-FOLDER  PIC X(200).
            03  TOUKEICSV-H-TO-DATA    PIC X(200).
            03  TOUKEICSV-H-PUTFLG     PIC X(1).
            03  TOUKEICSV-H-TITLE      PIC X(100).
            03  TOUKEICSV-H-TERMID     PIC X(32).
            03  TOUKEICSV-H-OPID       PIC X(16).
            03  TOUKEICSV-H-CREYMD     PIC X(8).
