      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
        02  D01.
            03  D01-FIXED6.
              04  D01-SRYYM.
                05  D01-VALUE   PIC X(7).
              04  D01-NYUGAIKBN.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN1.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN2.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN3.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN4.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN5.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN6.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN7.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN8.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN9.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN10.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN11.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN12.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN13.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN14.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN15.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN16.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN17.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN18.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN19.
                05  D01-VALUE   PIC X.
              04  D01-CHKBTN20.
                05  D01-VALUE   PIC X.
              04  D01-NYUGAIMSG.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG1.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG2.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG3.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG4.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG5.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG6.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG7.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG8.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG9.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG10.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG11.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG12.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG13.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG14.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG15.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG16.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG17.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG18.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG19.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG20.
                05  D01-VALUE   PIC X(62).
              04  D01-CHKMSG99.
                05  D01-VALUE   PIC X(62).
