        02  GFIL.
           03 GFIL-FIXED.
            04  GFIL-GFIL1.
              05  GFIL-OBJECTDATA  PIC X(8).
              05  GFIL-ENTRY1.
                06 GFIL-VALUE      PIC X(100).
            04  GFIL-TITLE         PIC X(100).
            04  GFIL-KENSU         PIC X(7).

