        01  HCM28.
            02  HCM28-HYODAI    PIC X(100).
            02  HCM28-JYOKEN    PIC X(100)      OCCURS  2 TIMES.
            02  HCM28-SAKUSEIBI PIC X(22).
            02  HCM28-PAGE  PIC X(6).
            02  HCM28-CD    PIC X(5)    OCCURS  30 TIMES.
            02  HCM28-PTNUM PIC X(10)   OCCURS  30 TIMES.
            02  HCM28-PTNUMUP   PIC X(10)       OCCURS  30 TIMES.
            02  HCM28-PTNUMDN   PIC X(10)       OCCURS  30 TIMES.
            02  HCM28-NAME  PIC X(30)   OCCURS  30 TIMES.
            02  HCM28-SEIBETU   PIC X(2)        OCCURS  30 TIMES.
            02  HCM28-TANJYOBI  PIC X(9)        OCCURS  30 TIMES.
            02  HCM28-AGENUM    PIC X(4)        OCCURS  30 TIMES.
            02  HCM28-AGETANI   PIC X(4)        OCCURS  30 TIMES.
            02  HCM28-POST  PIC X(8)    OCCURS  30 TIMES.
            02  HCM28-JYUSYO    PIC X(70)       OCCURS  30 TIMES.
            02  HCM28-JYUSYO2   PIC X(160)      OCCURS  30 TIMES.
