        01  HCM43V03.
            02  HCM43V03-NO PIC X(7).
            02  HCM43V03-LBLKKN PIC X(10).
            02  HCM43V03-SRYYM  PIC X(40).
            02  HCM43V03-KNJNAMW    PIC X(30).
            02  HCM43V03-KNJNO  PIC X(20).
            02  HCM43V03-MIDASI PIC X(20).
            02  HCM43V03-HAKYMD PIC X(22).
            02  HCM43V03-HOKEN  PIC X(20).
            02  HCM43V03-FUTAN  PIC X(3).
            02  HCM43V03-MEISAI
                    PIC X(20)   OCCURS  15 TIMES.
            02  HCM43V03-HKNRYO1    PIC X(18).
            02  HCM43V03-HKNRYO2    PIC X(18).
            02  HCM43V03-HKNRYO3    PIC X(18).
            02  HCM43V03-HKNRYO4    PIC X(18).
            02  HCM43V03-HKNRYO5    PIC X(18).
            02  HCM43V03-HKNRYO6    PIC X(18).
            02  HCM43V03-HKNRYO7    PIC X(18).
            02  HCM43V03-HKNRYO8    PIC X(18).
            02  HCM43V03-HKNRYO9    PIC X(18).
            02  HCM43V03-HKNRYO10   PIC X(18).
            02  HCM43V03-HKNRYO11   PIC X(18).
            02  HCM43V03-HKNRYO12   PIC X(18).
            02  HCM43V03-HKNRYO13   PIC X(18).
            02  HCM43V03-HKNRYO14   PIC X(18).
            02  HCM43V03-HKNRYO15   PIC X(18).
            02  HCM43V03-GOKTEN PIC X(18).
            02  HCM43V03-JIHIBUN
                    PIC X(18)   OCCURS  15 TIMES.
            02  HCM43V03-HOKENBUN   PIC X(18).
            02  HCM43V03-HOKENGAI   PIC X(18).
            02  HCM43V03-HOKENZEI   PIC X(18).
            02  HCM43V03-JIHIMSG1   PIC X(20).
            02  HCM43V03-JIHIMSG2   PIC X(20).
            02  HCM43V03-JIHIMSG3   PIC X(20).
            02  HCM43V03-JIHIMSG4   PIC X(20).
            02  HCM43V03-JIHIMSG5   PIC X(20).
            02  HCM43V03-JIHIMSG6   PIC X(20).
            02  HCM43V03-JIHIMSG7   PIC X(20).
            02  HCM43V03-JIHIMSG8   PIC X(20).
            02  HCM43V03-JIHIMSG9   PIC X(20).
            02  HCM43V03-JIHIMSG10  PIC X(20).
            02  HCM43V03-JIHI
                    PIC X(18)   OCCURS  12 TIMES.
            02  HCM43V03-YAKUZAI    PIC X(18).
            02  HCM43V03-ROUJIN PIC X(18).
            02  HCM43V03-KOUHI  PIC X(18).
            02  HCM43V03-CHOSEI PIC X(18).
            02  HCM43V03-KONSEIKYU  PIC X(18).
            02  HCM43V03-SEIKYUZEI  PIC X(18).
            02  HCM43V03-ZENMISYU   PIC X(18).
            02  HCM43V03-GOUKEIGAK  PIC X(18).
            02  HCM43V03-KONNYUKIN  PIC X(18).
            02  HCM43V03-IRYOADRS   PIC X(60).
            02  HCM43V03-IRYOMEI    PIC X(40).
            02  HCM43V03-IRYOTEL    PIC X(15).
            02  HCM43V03-MIDASHI    PIC X(10).
            02  HCM43V03-RSIMIDASI  PIC X(16).
            02  HCM43V03-RSIBUN PIC X(18).
            02  HCM43V03-RSIEN  PIC X(2).
