        01  HCN03.
            02  HCN03-NO    PIC X(7).
            02  HCN03-NYUINSTRYMD   PIC X(22).
            02  HCN03-NYUINENDYMD   PIC X(22).
            02  HCN03-HAKYMD    PIC X(22).
            02  HCN03-KNJNAMW   PIC X(20).
            02  HCN03-KNJNO PIC X(20).
            02  HCN03-ROOM  PIC X(50).
            02  HCN03-HOKEN PIC X(20).
            02  HCN03-FUTAN PIC X(6).
            02  HCN03-MIDASI    PIC X(20).
            02  HCN03-HKNRYO    PIC X(18)       OCCURS  12 TIMES.
            02  HCN03-HOKENBUN  PIC X(18).
            02  HCN03-HOKENGAI  PIC X(18).
            02  HCN03-JIHI  PIC X(18)   OCCURS  8 TIMES.
            02  HCN03-JIHIMSG   PIC X(20)       OCCURS  5 TIMES.
            02  HCN03-SYOKUJI   PIC X(18).
            02  HCN03-ROUJIN    PIC X(18).
            02  HCN03-KOUHI PIC X(18).
            02  HCN03-RMSAGAKU  PIC X(18).
            02  HCN03-CHOSEI    PIC X(18).
            02  HCN03-KONSEIKYU PIC X(18).
            02  HCN03-KONNYUKIN PIC X(18).
            02  HCN03-IRYOADRS  PIC X(60).
            02  HCN03-IRYOMEI   PIC X(40).
            02  HCN03-IRYOTEL   PIC X(15).
