        01  HCN62.
            02  HCN62-PNUM  PIC X(20).
            02  HCN62-NAME  PIC X(30).
            02  HCN62-JYOUTAI   PIC X(12).
            02  HCN62-PRTYMD    PIC X(22).
            02  HCN62-BIRTHDAY  PIC X(22).
            02  HCN62-RIYOUKBN  PIC X(10).
            02  HCN62-SANKAKBN  PIC X(6).
            02  HCN62-NYUIN-DAY PIC X(3).
            02  HCN62-NYU-MONEY PIC X(10).
            02  HCN62-RMSGK-MONEY   PIC X(10).
            02  HCN62-KAIJO-MONEY   PIC X(10).
            02  HCN62-BUNBEN-MONEY  PIC X(10).
            02  HCN62-SHIN-MONEY    PIC X(10).
            02  HCN62-KNS-MONEY PIC X(10).
            02  HCN62-SYC-MONEY PIC X(10).
            02  HCN62-SNK-MONEY PIC X(10).
            02  HCN62-ETC-MONEY PIC X(10).
            02  HCN62-ITBFTN-MONEY  PIC X(10).
            02  HCN62-NINPUFTN-MONEY    PIC X(10).
            02  HCN62-DAIRI-MONEY   PIC X(10).
            02  HCN62-COMMENT   PIC X(60).
            02  HCN62-HOSPADRS  PIC X(100).
            02  HCN62-HOSPNAME  PIC X(100).
            02  HCN62-HOSPTEL   PIC X(20).
