        02  I2FIL.
           03 I2FIL-FIXED.
            04  I2FIL-I2FIL1.
              05  I2FIL-OBJECTDATA  PIC X(8).
              05  I2FIL-ENTRY1.
                06 I2FIL-VALUE      PIC X(100).
            04  I2FIL-TITLE         PIC X(100).
            04  I2FIL-KENSU         PIC X(7).

