      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------*
      *    Æþ±¡²ñ·× ¶¦ÄÌ£Ó£Ð£Á
      *----------------------------------------------------------*
      ************************************************************
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *
      ************************************************************
      *
       01  SPA-I44-I48.
      *±¡³°¶èÊ¬
           03  SPA-NAI-INGAIKBN                   PIC 9(01).
      *¿ÇÎÅ¼ïÊÌ¥Á¥§¥Ã¥¯ÍÑ¥Æ¡¼¥Ö¥ë
           03  SPA-SRYKBN-AREA.
               05  SPA-SRYKBN-CNT                 PIC 9(01)   OCCURS 10.
      *¶Ø´÷ÌôºÞ¥Á¥§¥Ã¥¯
           03  SPA-KNKYAK-AREA.
               05  SPA-KNK-TBL                    OCCURS  100.
                   07  SPA-KNK-SRYCD              PIC X(09).
                   07  SPA-KNK-SRYMEI             PIC X(40).
                   07  SPA-KNK-TOGETU             PIC X(01).
                   07  SPA-KNK-SRYYM              PIC X(06)   OCCURS 12.
      *ÆÃÄêÌôºÞ¼£ÎÅ´ÉÍýÎÁ½é²óÇ¯·îÆü
           03  SPA-TOKTEI-YMD                     PIC X(08).
      *»þ´Ö³°ÆÃÎã°åÎÅµ¡´Ø
           03  SPA-JIKANTOKU                      PIC 9(01).
      *¾®»ù²Ê³°Íè¿ÇÎÅ²Ê
           03  SPA-SYONIKA                        PIC 9(01).
      *£É£´£¸²èÌÌÍÑ
           03  SPA-I48GMN-AREA.
               05  SPA-I48-GMN-MAX                PIC 9(03).
               05  SPA-I48-NEXT                   PIC 9(04).
               05  SPA-I48-GMN-SELNUM-G.
                   07  SPA-I48-GMN-SELNUM         PIC X(03)  OCCURS  5.
               05  SPA-I48-NAI-SELNUM-G.
                   07  SPA-I48-NAI-SELNUM         PIC 9(03)  OCCURS  5.
               05  SPA-I48-GMN-INPUT              PIC X(22).
               05  SPA-I48-GMN-SYORI              PIC X(01).
               05  SPA-I48-GMN-SYORI2             PIC X(01).
               05  SPA-I48-GMN-SYORI3             PIC X(02).
               05  SPA-I48-NAI-KENSA.
                   07  SPA-I48-NAI-KENSANO        PIC 9(02).
                   07  SPA-I48-NAI-HOUKATU        PIC X(01).
               05  SPA-I48-GMN-ALL                PIC X(01).
               05  SPA-I48-GMN-TBL.
                   07  SPA-I48-GMN-TBLREC         OCCURS   200.
                       09  SPA-I48-GMN-NO         PIC 9(03).
                       09  SPA-I48-GMN-NO-X       REDEFINES
                           SPA-I48-GMN-NO         PIC X(03).
                       09  SPA-I48-GMN-INPUTCD    PIC X(20).
                       09  SPA-I48-GMN-SRYCD      PIC X(09).
                       09  SPA-I48-GMN-NAME       PIC X(70).
                       09  SPA-I48-GMN-TANI       PIC X(10).
                       09  SPA-I48-GMN-KISOTEN    PIC 9(07)V99.
                       09  SPA-I48-NAI-NO         PIC 9(03).
      *¼«±¡ºÎÍÑ
               05  SPA-I48-JIIN-G.
                   07  SPA-I48-JIIN               PIC X(01).
               05  SPA-I48-JIIN-COB               OCCURS  10.
                   07  SPA-I48-JIINLST            PIC X(20).
               05  SPA-I48-USER-G.
                   07  SPA-I48-USER               PIC X(01).
               05  SPA-I48-USER-COB               OCCURS  10.
                   07  SPA-I48-USERLST            PIC X(20).
      *£É£´£¹²èÌÌÍÑ
           03  SPA-I49GMN-AREA.
               05  SPA-I49-IDX             PIC 9(04).
               05  SPA-I49-PED.
                   07  SPA-I49-PEDX        PIC X(02)  OCCURS  10.
      *
