        02  J022.
    ******  02  J022-FIXED1.
              03  J022-SRYYMD.
                04  J022-VALUE  PIC X(14).
              03  J022-DAY1-G.
                04  J022-DAY1-STATE  PIC S9(9)   BINARY.
                04  J022-DAY1   PIC S9(3).
              03  J022-DAY2-G.
                04  J022-DAY2-STATE  PIC S9(9)   BINARY.
                04  J022-DAY2  PIC S9(3).
              03  J022-DAY3-G.
                04  J022-DAY3-STATE  PIC S9(9)   BINARY.
                04  J022-DAY3  PIC S9(3).
              03  J022-MSG1.
                04  J022-VALUE  PIC X(10).
              03  J022-MSG2.
                04  J022-VALUE  PIC X(10).
              03  J022-MSG3.
                04  J022-VALUE  PIC X(10).
