        02  J022.
      ***** 02  J022-FIXED1.
              03  J022-SRYYMD.
                04  J022-VALUE  PIC X(14).
              03  J022-DAY1.
                04  J022-VALUE  PIC S9(3).
              03  J022-DAY2.
                04  J022-VALUE  PIC S9(3).
              03  J022-DAY3.
                04  J022-VALUE  PIC S9(3).
