      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------*
      *  ¿ÇÎÅ¹Ô°ÙÆþÎÏ ¶¦ÄÌ²èÌÌ£Ó£Ð£Á ¡Ê£Ë£°£³¡Ë
      *----------------------------------------------------------*
      ************************************************************
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      ************************************************************
      *
       01  SPA-K03.
           03  SPA-K03-AREA.
               05  SPA-GMN-PAGE                  PIC 9(02).
               05  SPA-MAX-PAGE                  PIC 9(02).
               05  SPA-GMN-LINE                  PIC 9(02).
               05  SPA-GMN-MAX                   PIC 9(02).
               05  SPA-GMN-CUR                   PIC 9(02).
               05  SPA-GMN-AREA.
      *
                   07  SPA-GMN-HAKYMD            PIC X(09).
                   07  SPA-GMN-DENPNUM           PIC X(07).
      *
                   07  SPA-GMN-HKNRYO            PIC 9(07)  OCCURS  11.
                   07  SPA-GMN-TGMONEY           PIC 9(07)  OCCURS  11.
      *
                   07  SPA-GMN-HKNTEKI           PIC 9(10).
                   07  SPA-GMN-ROUFTN            PIC 9(07).
                   07  SPA-GMN-KOHFTN            PIC 9(07).
                   07  SPA-GMN-JIHI1             PIC 9(07).
                   07  SPA-GMN-JIHI2             PIC 9(07).
                   07  SPA-GMN-JIHI3             PIC 9(07).
                   07  SPA-GMN-JIHI4             PIC 9(07).
                   07  SPA-GMN-JIHI5             PIC 9(07).
                   07  SPA-GMN-JIHIKEI           PIC 9(07).
                   07  SPA-GMN-JIHITAX1          PIC 9(07).
                   07  SPA-GMN-JIHITAX2          PIC 9(07).
                   07  SPA-GMN-JIHITAX3          PIC 9(07).
                   07  SPA-GMN-JIHITAX4          PIC 9(07).
                   07  SPA-GMN-JIHITAX5          PIC 9(07).
                   07  SPA-GMN-JIHITAXKEI        PIC 9(07).
                   07  SPA-GMN-JIHIZEI           PIC 9(07).
                   07  SPA-GMN-HKNGAI            PIC 9(07).
                   07  SPA-GMN-ICHIFTN           PIC 9(07).
                   07  SPA-GMN-JIHIGOK           PIC 9(07).
                   07  SPA-GMN-YKZFTN            PIC 9(07).
                   07  SPA-GMN-CHOSEI            PIC S9(07).
                   07  SPA-GMN-CHOSEI-X          PIC  X(10).
                   07  SPA-GMN-SEIKYU            PIC S9(07).
                   07  SPA-GMN-ZENMISYU          PIC S9(07).
                   07  SPA-GMN-SEIGOK            PIC S9(07).
                   07  SPA-GMN-NYUKIN            PIC S9(07).
                   07  SPA-GMN-NYUKIN-X          PIC  X(10).
      *
                   07  SPA-GMN-ROUSYOSIN         PIC S9(07).
                   07  SPA-GMN-ROUSAISIN         PIC S9(07).
                   07  SPA-GMN-ROUSIDOU          PIC S9(07).
                   07  SPA-GMN-ROUETC            PIC S9(07).
      *
                   07  SPA-GMN-HAKFLG-G.
                       09  SPA-GMN-HAKFLG            PIC X(01).
                       09  SPA-GMN-HAKFLGF           PIC X(01).
                       09  SPA-GMN-HAKFLGMSG         PIC X(16).
                   07  SPA-GMN-HAKFLG-LIST.
                       09  SPA-GMN-HAKFLGLST        PIC X(18)
                                                    OCCURS   2.
      *
                   07  SPA-GMN-SYOHOPRTFLG-G.
                       09  SPA-GMN-SYOHOPRTFLG      PIC X(01).
                       09  SPA-GMN-SYOHOH           PIC X(01).
                       09  SPA-GMN-SYOHOPRTMSG      PIC X(16).
                   07  SPA-GMN-SYOHOPRT-LIST.
                       09  SPA-GMN-SYOHOPRTLST        PIC X(18)
                                                    OCCURS   3.
      *            ÌôºÞ¾ðÊó
                   07  SPA-GMN-YAKJYOFLG-G.
                       09  SPA-GMN-YAKJYOFLG        PIC X(01).
                       09  SPA-GMN-YAKJYOH          PIC X(01).
                       09  SPA-GMN-YAKJYOFLGMSG     PIC X(16).
                   07  SPA-GMN-YAKUJYO-LIST.
                       09  SPA-GMN-YAKJYOLST        PIC X(18)
                                                    OCCURS   3.
      *
                   07  SPA-GMN-JIHIMSG           PIC X(20)
                                                 OCCURS   5.
                   07  SPA-GMN-DRCD-G.
                       09  SPA-GMN-DRCD        PIC X(04).
                       09  SPA-GMN-F1          PIC X(01).
                       09  SPA-GMN-DRCDMEI     PIC X(20).
                   07  SPA-GMN-DRCDLST                    OCCURS  10.
                       09  SPA-GMN-DRCDL       PIC X(04).
                       09  SPA-GMN-F1L         PIC X(01).
                       09  SPA-GMN-DRCDMEIL    PIC X(20).
                   07  SPA-DRCD-MAX            PIC 9(04).
      *
               05  SPA-NAI-AREA.
                   07  SPA-NAI-SEIKYU            PIC S9(07).
                   07  SPA-KON-SKYMONEY          PIC S9(07).
                   07  SPA-NAI-CHOSEI            PIC X(01).
      *
      *    £Ã£Ì£Á£É£Í²èÌÌ
           03  SPA-K03X-AREA.
               05  SPA-K03X-FLG                        PIC X(02).
               05  SPA-K03X-CODE                       PIC X(01).
               05  SPA-K03X-CUR                        PIC 9(02).
      *
               05  SPA-K03X-GMN-SEL                    PIC 9(03).
               05  SPA-K03X-GMN-ADRLST.
                   07  SPA-K03X-GMN-ADR-TBL        OCCURS  10.
                       09  SPA-K03X-GMN-SELNOL     PIC 9(03).
                       09  SPA-K03X-GMN-ADRL       PIC X(22).
                       09  SPA-K03X-GMN-PORTL      PIC X(22).
                       09  SPA-K03X-GMN-MEMOL      PIC X(22).
                   07  SPA-K03X-GMN-MAX            PIC 9(04).
               05  SPA-GMN-SCODE-G.
                   07  SPA-GMN-SCODE           PIC X(01).
                   07  SPA-GMN-F1              PIC X(01).
                   07  SPA-GMN-SCODEMEI        PIC X(18).
      *
