        02  KDMY01.
      ***** 02  KDMY01-FIXED1.
              03  KDMY01-PANDAPRINT1.
                04  KDMY01-ITEM     OCCURS  10 TIMES.
                  05  KDMY01-PATH PIC X(256).
                  05  KDMY01-TITLE    PIC X(256).
                  05  KDMY01-SHOWDIALOG   PIC S9(9)   BINARY.
                  05  KDMY01-NRETRY   PIC S9(9)   BINARY.
