        02  LDMY01.
      ***** 02  LDMY01-FIXED1.
              03  LDMY01-PANDAPRINT1.
                04  LDMY01-ITEM     OCCURS  10 TIMES.
                  05  LDMY01-PATH PIC X(256).
                  05  LDMY01-TITLE    PIC X(256).
                  05  LDMY01-SHOWDIALOG   PIC S9(9)   BINARY.
                  05  LDMY01-NRETRY   PIC S9(9)   BINARY.
