        02  M80ERR.
     ****** 02  M80-FIXED1.
              03  M80ERR-ERRCODE.
                04  M80ERR-VALUE   PIC X(10).
              03  M80ERR-ERRMSG.
                04  M80ERR-VALUE   PIC X(80).
