        02  M80ID1.
     *****  02  M80ID1-FIXED1.
              03  M80ID1-ID1CODE.
                04  M80ID1-VALUE   PIC X(10).
              03  M80ID1-ID1MSG.
                04  M80ID1-VALUE   PIC X(80).
