        02  MUID.
      ***** 02  MUID-FIXED3.
              03  MUID-USER.
                04  MUID-VALUE  PIC X(30).
              03  MUID-PASSWORD.
                04  MUID-VALUE  PIC X(30).
