      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *****************************************************************
      *    ÌôºÞ¾ðÊóÅÐÏ¿ ¶¦ÄÌ²èÌÌ£Ó£Ð£Á  
      *****************************************************************
      *****************************************************************
      *  ¥×¥í¥°¥é¥à½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *****************************************************************
       01  SPA-N21SCRAREA.
      *
      *  ÌôºÞ¾ðÊóÅÐÏ¿¡Ê£Î£²£±¡Ë
         03  SPA-N21-AREA.
             05  SPA-GMN-CUR           PIC 9(02).
             05  SPA-GMN-MAX           PIC 9(05).
      *
             05  SPA-GMN-AREA.
               07  SPA-GMN-KENCD       PIC X(21).
               07  SPA-GMN-KENNAIYO    PIC X(27).
               07  SPA-GMN-KENNAME     PIC X(101).
               07  SPA-GMN-SELNUM      PIC 9(03).
      *
               07  SPA-GMN-TBL.
                 09  SPA-GMN-TBL-G     OCCURS  200.
                   11  SPA-GMN-TNO     PIC X(05).
                   11  SPA-GMN-TNAME   PIC X(100).
                 09  SPA-GMN-TCD       PIC X(09)
                                       OCCURS  200.
      *
               07  SPA-GMN-ENTRY.
                 09  SPA-GMN-NAME      PIC X(80).
                 09  SPA-GMN-EFFECT    PIC X(186).
                 09  SPA-GMN-COLOR     PIC X(136).
                 09  SPA-GMN-SHAPE     PIC X(136).
                 09  SPA-GMN-MARK      PIC X(136).
                 09  SPA-GMN-CAUTION   PIC X(410).
                 09  SPA-GMN-PHOTO     PIC X(256).
                 09  SPA-GMN-OBJECT    PIC X(08).
      *
           05  SPA-NAI-AREA.
             07  SPA-NAI-SRYCD         PIC X(09).
      *
      *  ÌôºÞ¾ðÊóÅÐÏ¿¡Ê£Î£²£²¡Ë
           03  SPA-N22-AREA.
             05  SPA-N22-MAX           PIC 9(05).
             05  SPA-N22-CUR           PIC 9(02).
      *
             05  SPA-N22-KENCD         PIC X(9).
             05  SPA-N22-KENNAME       PIC X(101).
             05  SPA-N22-SELNUM        PIC 9(03).
             05  SPA-N22-MESSAGE-STYLE PIC X(20).
             05  SPA-N22-MESSAGE       PIC X(100).
             05  SPA-N22-OBJECTAREA.
               07  SPA-N22-OBJECT-G    OCCURS   3.
                 09  SPA-N22-OBJECT    PIC X(08).
                 09  SPA-N22-LABEL     PIC X(14).
      *
             05  SPA-N22-GAZOCOMBO.
               07  SPA-N22-GAZOKBNLST      OCCURS  4.
                 09  SPA-N22-GAZOKBNL      PIC X(01).
                 09  SPA-N22-F1L           PIC X(01).
                 09  SPA-N22-GAZOKBNMEIL   PIC X(12).
               07  SPA-N22-GAZOKBN-MAX     PIC 9(02).
      *
               07  SPA-N22-GAZOKBN-G.
                 09  SPA-N22-GAZOKBN       PIC X(01).
                 09  SPA-N22-F1            PIC X(01).
                 09  SPA-N22-GAZOKBNMEI    PIC X(12).
      *
             05  SPA-N22-COPYCOMBO.
               07  SPA-N22-COPYKBNLST      OCCURS  3.
                 09  SPA-N22-COPYKBNL      PIC X(01).
                 09  SPA-N22-F1L           PIC X(01).
                 09  SPA-N22-COPYKBNMEIL   PIC X(12).
               07  SPA-N22-COPYKBN-MAX     PIC 9(02).
      *
               07  SPA-N22-COPYKBN-G.
                 09  SPA-N22-COPYKBN       PIC X(01).
                 09  SPA-N22-F1            PIC X(01).
                 09  SPA-N22-COPYKBNMEI    PIC X(12).
      *
             05  SPA-N22-TBL.
               07  SPA-N22-TBL-G       OCCURS  100.
                 09  SPA-N22-TNO       PIC X(05).
                 09  SPA-N22-TYJCD     PIC X(12).
                 09  SPA-N22-TGAZO     PIC X(5).
                 09  SPA-N22-TMAKER    PIC X(50).
                 09  SPA-N22-TSELLER   PIC X(50).
                 09  SPA-N22-EFFECT    PIC X(186).
                 09  SPA-N22-COLOR     PIC X(136).
                 09  SPA-N22-SHAPE     PIC X(136).
                 09  SPA-N22-MARK      PIC X(136).
                 09  SPA-N22-CAUTION   PIC X(410).
                 09  SPA-N22-PHOTO1    PIC X(256).
                 09  SPA-N22-PHOTO2    PIC X(256).
                 09  SPA-N22-PHOTO3    PIC X(256).
