      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this licence along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *****************************************************************
      *  プログラム修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      *****************************************************************
        02  P02E.
      ******02  P02E-FIXED10.
              03  P02E-PTNUM.
                04  P02E-VALUE  PIC X(20).
              03  P02E-ADRS1.
                04  P02E-VALUE  PIC X(100).
              03  P02E-NAME.
                04  P02E-VALUE  PIC X(50).
              03  P02E-ADRS2.
                04  P02E-VALUE  PIC X(100).
              03  P02E-BIRTHDAY.
                04  P02E-VALUE  PIC X(09).
              03  P02E-NENREI.
                04  P02E-VALUE  PIC X(8).
              03  P02E-SEX.
                04  P02E-VALUE  PIC X(4).
