        02  QFIL.
           03 QFIL-FIXED.
            04  QFIL-QFIL1.
              05  QFIL-OBJECTDATA  PIC X(8).
              05  QFIL-ENTRY1.
                06 QFIL-VALUE      PIC X(100).
            04  QFIL-TITLE         PIC X(100).
            04  QFIL-KENSU         PIC X(7).

