      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this licence along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
        02  R03.
              03  R03-SRYYM.
                04  R03-VALUE   PIC X(8).
              03  R03-SYOKBN.
                04  R03-SYOKBN-VALUE   PIC X.
                04  R03-SYOKBN-LABEL   PIC X(20).
              03  R03-DATAKBN2.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN3.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN22.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN23.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN1.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN21.
                04  R03-VALUE   PIC X.
              03  R03-IKKATU.
                04  R03-VALUE   PIC X.
              03  R03-KOBETU.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN31.
                04  R03-VALUE   PIC X.
              03  R03-DATAKBN11.
                04  R03-VALUE   PIC X.
