        02  SDMY01.
      ***** 02  SDMY01-FIXED1.
              03  SDMY01-PANDAPRINT1.
                04  SDMY01-ITEM     OCCURS  10 TIMES.
                  05  SDMY01-PATH PIC X(256).
                  05  SDMY01-TITLE    PIC X(256).
                  05  SDMY01-SHOWDIALOG   PIC S9(9)   BINARY.
                  05  SDMY01-NRETRY   PIC S9(9)   BINARY.
