      *******************************************************************
      * Project code name "ORCA"
      * ∆¸∞Â…∏Ω‡•Ï•ª•◊•»•Ω•’•»° JMA standard receipt software°À
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *****************************************************************
      *
      *    ¡Ì≥Á…Ω°¶∏¯»Ò¿¡µ·ΩÒ≤ËÃÃ£”£–£¡     (SPA-FREE §Œ∆‚Õ∆)
      *          
      *****************************************************************
      *  •≥•‘°º∂ÁΩ§¿µÕ˙ŒÚ
      * Maj/Min/Rev  Ω§¿µº‘       ∆¸…’      ∆‚Õ∆
      *****************************************************************
      *
       01  SPA-T01FREE.
      *
      *    ¡Ì≥Á…Ω°¶∏¯»Ò¿¡µ·ΩÒ∫Ó¿Æ
           03  SPA-T01-AREA.
               05  SPA-GMN-MAX                     PIC 9(04).
               05  SPA-GMN-PAGE                    PIC 9(02).
               05  SPA-GMN-CUR                     PIC 9(02).
               05  SPA-GMN-AREA.
                   07  SPA-GMN-DATAKBNLST          OCCURS  3.
                       09  SPA-GMN-DATAKBNL        PIC X(01).
                       09  SPA-GMN-F1L             PIC X(01).
                       09  SPA-GMN-DATAKBNMEIL     PIC X(20).
                   07  SPA-GMN-DATAKBN-MAX         PIC 9(02).    
                   07  SPA-GMN-NYUGAIKBNLST        OCCURS  3.
                       09  SPA-GMN-NYUGAIKBNL      PIC X(01).
                       09  SPA-GMN-F1L             PIC X(01).
                       09  SPA-GMN-NYUGAIKBNMEIL   PIC X(12).
                   07  SPA-GMN-NYUGAIKBN-MAX       PIC 9(02).    
      *                                             
                   07  SPA-GMN-DATAKBN-G.
                       09  SPA-GMN-DATAKBN         PIC X(01).
                       09  SPA-GMN-F1              PIC X(01).
                       09  SPA-GMN-DATAKBNMEI      PIC X(20).
      *                                             
                   07  SPA-GMN-NYUGAIKBN-G.
                       09  SPA-GMN-NYUGAIKBN       PIC X(01).
                       09  SPA-GMN-F1              PIC X(01).
                       09  SPA-GMN-NYUGAIKBNMEI    PIC X(12).
      *                                             
                   07  SPA-GMN-SKYYM               PIC X(07).
                   07  SPA-GMN-SRYYM               PIC X(20).
                   07  SPA-GMN-SKYYMD              PIC X(10).
                   07  SPA-GMN-PRTKBN1.
                       09  SPA-GMN-PRTKBN1-STYLE   PIC X(20).
                       09  SPA-GMN-PRTKBN1-VALUE   PIC X(04). 
                   07  SPA-GMN-PRTKBN2.
                       09  SPA-GMN-PRTKBN2-STYLE   PIC X(20).
                       09  SPA-GMN-PRTKBN2-VALUE   PIC X(04).
                   07  SPA-GMN-HKNJANUM            PIC X(08).
                   07  SPA-GMN-HKNJAMEI            PIC X(40). 
      *
               05  SPA-NAIB-T01-AREA.
                   07  SPA-NAI-WIDGET              PIC X(08). 
                   07  SPA-NAI-SKYYM               PIC 9(06).
                   07  SPA-NAI-SRYYM               PIC 9(06).
                   07  SPA-NAI-SKYYMD              PIC 9(08).
                   07  SPA-NAI-PRTKBN1             PIC X(01).
                   07  SPA-NAI-PRTKBN2             PIC X(01).
                   07  SPA-NAI-HKNJANUM            PIC X(08). 
      *
               05  SPA-STATE.             
                   07  SPA-B06-STATE               PIC S9(09)  BINARY.
                   07  SPA-B07-STATE               PIC S9(09)  BINARY.
                   07  SPA-B21-STATE               PIC S9(09)  BINARY.
                   07  SPA-DATA-STATE              PIC S9(09)  BINARY.
                   07  SPA-NYUGAIKBN-STATE         PIC S9(09)  BINARY.
                   07  SPA-SRYYM-STATE             PIC S9(09)  BINARY.
                   07  SPA-DATAKBN1-STATE          PIC S9(09)  BINARY.
                   07  SPA-DATAKBN2-STATE          PIC S9(09)  BINARY.
                   07  SPA-DATAKBN3-STATE          PIC S9(09)  BINARY.
                   07  SPA-DATAKBN4-STATE          PIC S9(09)  BINARY.
                   07  SPA-DATAKBN5-STATE          PIC S9(09)  BINARY.
      *
               05  SPA-DATAKBN.         
                   07  SPA-DATAKBN1-VALUE          PIC X(01).
                   07  SPA-DATAKBN2-VALUE          PIC X(01).
                   07  SPA-DATAKBN3-VALUE          PIC X(01).
                   07  SPA-DATAKBN4-VALUE          PIC X(01).
                   07  SPA-DATAKBN5-VALUE          PIC X(01).
      *
               05  SPA-3004-AREA.
                   07  SPA-3004-MAX                PIC 9(02).
                   07  SPA-3004-TBL                OCCURS  25.
                       09  SPA-3004-SHELLID        PIC X(20).
                       09  SPA-3004-PARAKBN        PIC X(01). 
                       09  SPA-3004-PRTNM          PIC X(16).
                       09  SPA-3004-CHK.
                           11  SPA-3004-CHKFLG     PIC  X(01)
                                                   OCCURS   4.
      *
               05  SPA-NAI-1031-PRTNM              PIC X(16). 
      *
      *    ∏¯»Ò∏ƒ ÃªÿƒÍ
           03  SPA-T02-AREA.
               05  SPA-GMN-T02-MAX                     PIC 9(04).
               05  SPA-GMN-T02-PAGE                    PIC 9(02).
               05  SPA-GMN-T02-CUR                     PIC 9(02).
               05  SPA-GMN-T02-NEXT                    PIC 9(02).
               05  SPA-GMN-T02-AREA.
                   07  SPA-GMN-T02-SYORIFLGLST         OCCURS  3.
                       09  SPA-GMN-T02-SYORIFLGL       PIC X(01).
                       09  SPA-GMN-T02-F1L             PIC X(01).
                       09  SPA-GMN-T02-SYORIFLGMEIL    PIC X(12).
                   07  SPA-GMN-T02-SYORIFLG-MAX        PIC 9(02).
      * 
                   07  SPA-GMN-T02-SHELLID-TBL.
                       09  SPA-GMN-T02-SHELLID-TBL-O   OCCURS   25.
                           11  SPA-GMN-T02-TRENNUM1    PIC 9(03).
                           11  SPA-GMN-T02-TSHORIMSG   PIC X(40).
                           11  SPA-GMN-T02-TPARAKBN    PIC X(10).
                       09  SPA-GMN-T02-SHELLID-MAX     PIC 9(02).
      * 
                   07  SPA-GMN-T02-TSYORIFLG-TBL.
                       09  SPA-GMN-T02-TSYORIFLG       PIC X(01)
                                                       OCCURS   25.
      * 
                   07  SPA-GMN-T02-PARA-TBL.
                       09  SPA-GMN-T02-TITLE1          PIC X(10).
                       09  SPA-GMN-T02-TITLE2          PIC X(08). 
                       09  SPA-GMN-T02-PARA-TBL-O      OCCURS   100.
                           11  SPA-GMN-T02-TRENNUM2    PIC 9(03).
                           11  SPA-GMN-T02-TPARA       PIC X(20).
                           11  SPA-GMN-T02-TNAME       PIC X(50).
                       09  SPA-GMN-T02-PARA-MAX        PIC 9(03).
      *                                             
                   07  SPA-GMN-T02-KOUMOKU.
                       09  SPA-GMN-T02-SELNUM1-X.
                           11  SPA-GMN-T02-SELNUM1     PIC 9(03).
                       09  SPA-GMN-T02-SYORIFLG-G.
                           11  SPA-GMN-T02-SYORIFLG    PIC X(01).
                           11  SPA-GMN-T02-F1          PIC X(01).
                           11  SPA-GMN-T02-SYORIFLGMEI PIC X(12).
                       09  SPA-GMN-T02-SHORIMSG        PIC X(40).
                       09  SPA-GMN-T02-KOUMOKU2.
                           11  SPA-GMN-T02-SELNUM2     PIC 9(03).
                           11  SPA-GMN-T02-PARA        PIC X(20).
                           11  SPA-GMN-T02-NAME        PIC X(50).
      *
               05  SPA-NAI-T02-AREA.
                   07  SPA-NAI-T02-KOUMOKU.
                       09  SPA-NAI-T02-SELNUM1         PIC 9(03).
                       09  SPA-NAI-T02-BTPARA-RENNUM   PIC 9(04).
                       09  SPA-NAI-T02-KOUMOKU2.
                           11  SPA-NAI-T02-SELNUM2     PIC 9(03).
                           11  SPA-NAI-T02-PTID        PIC 9(10).
      *
                   07  SPA-NAI-T02-SHELLID-TBL.
                       09  SPA-NAI-T02-SHELLID-TBL-O   OCCURS   25.
                           11  SPA-NAI-T02-TPARAKBN    PIC X(01).
                           11  SPA-NAI-T02-TSHELLID    PIC X(20).
                           11  SPA-NAI-T02-TKBNCD      PIC 9(03).
                           11  SPA-NAI-T02-TPRTNM      PIC X(16).
                           11  SPA-NAI-T02-TJOBID      PIC 9(03).
      * 
                   07  SPA-NAI-T02-PARA-TBL.
                       09  SPA-NAI-T02-PARA-TBL-O      OCCURS   100.
                           11  SPA-NAI-T02-TPTID       PIC 9(10).
