        02  UDMY01.
      ****  02  UDMY01-FIXED1.
              03  UDMY01-PANDAPRINT1.
                04  UDMY01-ITEM     OCCURS  10 TIMES.
                  05  UDMY01-PRTPATH      PIC X(256).
                  05  UDMY01-PRTTITLE     PIC X(256).
                  05  UDMY01-SHOWDIALOG   PIC S9(9)   BINARY.
                  05  UDMY01-NRETRY   PIC S9(9)   BINARY.
