      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *    °åÎÅµ¡´Ø¾ðÊó¡¼Æþ±¡´ðËÜ²èÌÌ£Ó£Ð£Á    (SPA-FREE ¤ÎÆâÍÆ)
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *****************************************************************
      *
       01  SPA-W24FREE.
      *  °åÎÅµ¡´ØÆþ±¡¾ðÊó²èÌÌ£Ó£Ð£Á
         03  SPA-W24.
           05  SPA-W24-AREA.
             07  SPA-GMN-W24-PAGE                      PIC 9(02).
             07  SPA-GMN-W24-LINE                      PIC 9(02).
             07  SPA-GMN-W24-MAX                       PIC 9(04).
             07  SPA-GMN-W24-CUR                       PIC 9(03).
             07  SPA-GMN-W24-MOTOPG                    PIC X(08).
             07  SPA-GMN-W24-MOTOIDX                   PIC 9(05).
             07  SPA-GMN-W24-AREA.
      *        ÆþÎÏ¹àÌÜÎÎ°è
               09  SPA-GMN-W24-INPUT-AREA.
      *          Í­¸ú³«»ÏÆü
                 11  SPA-GMN-W24-STYUKYMD              PIC X(10).
      *          Í­¸ú½ªÎ»Æü
                 11  SPA-GMN-W24-EDYUKYMD              PIC X(10).
      *
      *          ¿©»ö¾ðÊó
                 11  SPA-GMN-W24-FRAME1.
      *            Æþ±¡»þ¿©»öÎÅÍÜ
                   13  SPA-GMN-W24-SKJRYOYO-G.
                     15  SPA-GMN-W24-SKJRYOYO          PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SKJRYOYOMEI       PIC X(26).
      *            ¿©»ö¿ÇÎÅ¹Ô°Ù
                   13  SPA-GMN-W24-LBLSKJSRY           PIC X(20)
                                                       OCCURS  2.
                   13  SPA-GMN-W24-SKJSRY-G.
                     15  SPA-GMN-W24-SKJSRY-OCC        OCCURS  2.
                       17  SPA-GMN-W24-SKJSRY          PIC X(01).
                       17                              PIC X(01).
                       17  SPA-GMN-W24-SKJSRYMEI       PIC X(26).
      *
      *          ¼¼ÎÁº¹³Û¾ÃÈñÀÇ¶èÊ¬
                 11  SPA-GMN-W24-BRMSGK-TAX-G.
                   13  SPA-GMN-W24-BRMSGK-TAX          PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-BRMSGK-TAXMEI       PIC X(08).
      *          Æþ±¡²ñ·×¼¼ÎÁº¹³Û¶èÊ¬
                 11  SPA-GMN-W24-NACCT-BRMSGK-G.
                   13  SPA-GMN-W24-NACCT-BRMSGK        PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-NACCT-BRMSGKMEI     PIC X(12).
      *          Æþ±¡²ñ·×³°ÇñÅÐÏ¿¶èÊ¬
                 11  SPA-GMN-W24-NACCT-GAIHAKU-G.
                   13  SPA-GMN-W24-NACCT-GAIHAKU       PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-NACCT-GAIHAKUMEI    PIC X(12).
      *          Æþ±¡²Ã»»¾ðÊó
                 11  SPA-GMN-W24-FRAME3.
                   13  SPA-GMN-W24-NYUKSN-G.
                     15 SPA-GMN-W24-NYUKSN-OCC         OCCURS 20.
                       17 SPA-GMN-W24-CHK-NYUKSN       PIC X(01).
                       17 SPA-GMN-W24-NYUKSNMEI        PIC X(32).
      *            ÃÏ°è²Ã»»
                   13  SPA-GMN-W24-CHIIKIKSN-G.
                     15 SPA-GMN-W24-CHIIKIKSN          PIC X(01).
                     15                                PIC X(01).
                     15 SPA-GMN-W24-CHIIKIKSNMEI       PIC X(26).
                   13  SPA-GMN-W24-CHIIKIKSNSRYCD      PIC X(09).
      *
      *          Æþ±¡²ñ·×É½¼¨¾ðÊó
                 11  SPA-GMN-W24-FRAME4.
                   13  SPA-GMN-W24-SRYCD-OCC           OCCURS 10.
                       15  SPA-GMN-W24-SRYCD           PIC X(09).
                       15  SPA-GMN-W24-SRYACT          PIC X(30).
      *
      *          ÁªÄêÆþ±¡ÎÁ
                 11  SPA-GMN-W24-FRAME5.
      *            ÉéÃ´·×»»¶èÊ¬
                   13  SPA-GMN-W24-SENTEI-FTNKBN-G.
                     15  SPA-GMN-W24-SENTEI-FTNKBN     PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SENTEI-FTNKBNMEI  PIC X(20).
      *            ÅÀ¿ôÃ±²Á
                   13  SPA-GMN-W24-SENTEI-TANKA        PIC S9(4).
      *            ÅÀ¿ôÃ±²Á¡Ê°ìÈÌ¡Ë
                   13  SPA-GMN-W24-SENTEI-TANKAIP      PIC S9(4).
      *            ÅÀ¿ôÃ±²Á¡ÊÏ·¿Í¡Ë
                   13  SPA-GMN-W24-SENTEI-TANKARJ      PIC S9(4).
      *            ¾ÃÈñÀÇ
                   13  SPA-GMN-W24-SENTEI-TAX-G.
                     15  SPA-GMN-W24-SENTEI-TAX        PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SENTEI-TAXMEI     PIC X(18).
      *            ¥é¥Ù¥ë£±
                   13  SPA-GMN-W24-LBL-SENTEI-TANKA    PIC X(8).
                   13  SPA-GMN-W24-LBL-SENTEI-EN       PIC X(2).
      *          Æþ±¡ÎòÉ½¼¨
                 11  SPA-GMN-W24-REKI-DISPKBN-G.
                   13  SPA-GMN-W24-REKI-DISPKBN        PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-REKI-DISPKBNMEI     PIC X(22).
      *          ÀÁµá½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-SKYPRTKBN-G.
                   13  SPA-GMN-W24-SKYPRTKBN           PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-SKYPRTKBNMEI        PIC X(28).
      *          ÀÁµá½ñÌ¤¼ý³Û°õºþ¶èÊ¬
                 11  SPA-GMN-W24-MISYUPRTKBN-G.
                   13  SPA-GMN-W24-MISYUPRTKBN         PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-MISYUPRTKBNMEI      PIC X(18).
      *          Âà±¡¾ÚÌÀ½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-TAIPRTKBN-G.
                   13  SPA-GMN-W24-TAIPRTKBN           PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-TAIPRTKBNMEI        PIC X(18).
      *        ¥³¥ó¥Ü¹àÌÜÎÎ°è
               09  SPA-GMN-W24-CMB-DAT-AREA.
      *          Æþ±¡»þ¿©»öÎÅÍÜ
                 11  SPA-GMN-W24-SKJRYOYOLST-G.
                   13  SPA-GMN-W24-SKJRYOYO-MAX        PIC 9(03).
                   13  SPA-GMN-W24-SKJRYOYOLST         OCCURS  5.
                       15  SPA-GMN-W24-SKJRYOYOL       PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-SKJRYOYOMEIl    PIC X(26).
      *          ¿©»ö¿ÇÎÅ¹Ô°Ù
                 11  SPA-GMN-W24-SKJSRYLST-G.
                   13  SPA-GMN-W24-SKJSRY-MAX          PIC 9(03).
                   13  SPA-GMN-W24-SKJSRYLST           OCCURS  5.
                       15  SPA-GMN-W24-SKJSRYL         PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-SKJSRYMEIL      PIC X(26).
      *          ÃÏ°è²Ã»»
                 11  SPA-GMN-W24-CHIIKIKSNLST-G.
                   13  SPA-GMN-W24-CHIIKIKSN-MAX       PIC 9(03).
                   13  SPA-GMN-W24-CHIIKIKSNLST        OCCURS  6.
                       15  SPA-GMN-W24-CHIIKIKSNL      PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-CHIIKIKSNMEIL   PIC X(26).
      *          Æþ±¡ÎòÉ½¼¨
                 11  SPA-GMN-W24-REKI-DISPKBNLST-G.
                   13  SPA-GMN-W24-REKI-DISPKBN-MAX    PIC 9(03).
                   13  SPA-GMN-W24-REKI-DISPKBNLST     OCCURS  5.
                       15  SPA-GMN-W24-REKI-DISPKBNL   PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-REKI-DISPKBNMEIL PIC X(22).
      *
      *          ÀÁµá½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-SKYPRTKBNLST-G.
                   13  SPA-GMN-W24-SKYPRTKBN-MAX       PIC 9(03).
                   13  SPA-GMN-W24-SKYPRTKBNLST        OCCURS  5.
                       15  SPA-GMN-W24-SKYPRTKBNL      PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-SKYPRTKBNMEIL   PIC X(28).
      *
      *          Âà±¡¾ÚÌÀ½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-TAIPRTKBNLST-G.
                   13  SPA-GMN-W24-TAIPRTKBN-MAX       PIC 9(03).
                   13  SPA-GMN-W24-TAIPRTKBNLST        OCCURS  5.
                       15  SPA-GMN-W24-TAIPRTKBNL      PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-TAIPRTKBNMEIL   PIC X(18).
      *
      *          ÁªÄêÆþ±¡ÎÁ¡ÝÉéÃ´¶èÊ¬
                 11  SPA-GMN-W24-SENTEI-FTNKBNLST-G.
                   13  SPA-GMN-W24-SENTEI-FTNKBN-MAX   PIC 9(03).
                   13  SPA-GMN-W24-SENTEI-FTNKBNLST    OCCURS 10.
                       15  SPA-GMN-W24-SENTEI-FTNKBNL  PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-SENTEI-FTNKBNMEIL
                                                       PIC X(20).
      *
      *          ÁªÄêÆþ±¡ÎÁ¡Ý¾ÃÈñÀÇ
                 11  SPA-GMN-W24-SENTEI-TAXLST-G.
                   13  SPA-GMN-W24-SENTEI-TAX-MAX      PIC 9(03).
                   13  SPA-GMN-W24-SENTEI-TAXLST       OCCURS  5.
                       15  SPA-GMN-W24-SENTEI-TAXL     PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-SENTEI-TAXMEIL  PIC X(18).
      *
      *          ÀÁµá½ñÌ¤¼ý³Û°õºþ¶èÊ¬
                 11  SPA-GMN-W24-MISYUPRTKBNLST-G.
                   13  SPA-GMN-W24-MISYUPRTKBN-MAX     PIC 9(03).
                   13  SPA-GMN-W24-MISYUPRTKBNLST      OCCURS  5.
                       15  SPA-GMN-W24-MISYUPRTKBNL    PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-MISYUPRTKBNMEIL PIC X(18).
      *
      *          ¼¼ÎÁº¹³Û¾ÃÈñÀÇ¶èÊ¬
                 11  SPA-GMN-W24-BRMSGK-TAXLST-G.
                   13  SPA-GMN-W24-BRMSGK-TAX-MAX      PIC 9(03).
                   13  SPA-GMN-W24-BRMSGK-TAXLST       OCCURS  5.
                       15  SPA-GMN-W24-BRMSGK-TAXL     PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-BRMSGK-TAXMEIL  PIC X(08).
      *
      *          Æþ±¡²ñ·×¼¼ÎÁº¹³Û¶èÊ¬
                 11  SPA-GMN-W24-NACCT-BRMSGKLST-G.
                   13  SPA-GMN-W24-NACCT-BRMSGK-MAX    PIC 9(03).
                   13  SPA-GMN-W24-NACCT-BRMSGKLST     OCCURS  5.
                       15  SPA-GMN-W24-NACCT-BRMSGKL   PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-NACCT-BRMSGKMEIL PIC X(14).
      *
      *          Æþ±¡²ñ·×³°Çñ¶èÊ¬
                 11  SPA-GMN-W24-NACCT-GAIHAKULST-G.
                   13  SPA-GMN-W24-NACCT-GAIHAKU-MAX   PIC 9(03).
                   13  SPA-GMN-W24-NACCT-GAIHAKULST    OCCURS  5.
                       15  SPA-GMN-W24-NACCT-GAIHAKUL  PIC X(01).
                       15                              PIC X(01).
                       15  SPA-GMN-W24-NACCT-GAIHAKUMEIL PIC X(12).
      *
             07  SPA-NAI-W24-AREA.
               09  SPA-NAI-W24-SKJSRY-SRYCD-G.
                 11  SPA-NAI-W24-SKJSRY-SRYCD-OCC      OCCURS  2.
                     13  SPA-NAI-W24-SKJSRY-SRYCD      PIC X(09).
               09  SPA-NAI-W24-NYUKSN-SRYCD-G.
                 11  SPA-NAI-W24-NYUKSN-SRYCD-OCC      OCCURS  20.
                     13  SPA-NAI-W24-NYUKSN-SRYCD      PIC X(09).
      *
      *    ¿ÇÎÅ¹Ô°Ù¸¡º÷²èÌÌ£Ó£Ð£Á
           03  SPA-W25-MOTOPG                    PIC X(08).
           03  SPA-W25GMN-AREA.
               05  SPA-W25-GMN-MAX               PIC 9(03).
               05  SPA-W25-NEXT                  PIC 9(04).
               05  SPA-W25-GMN-CUR               PIC 9(03).
      *
               05  SPA-W25-GMN-SELNUM-G.
                   07  SPA-W25-GMN-SELNUM        PIC X(03)
                                                 OCCURS  5.
               05  SPA-W25-NAI-SELNUM-G.
                   07  SPA-W25-NAI-SELNUM        PIC 9(03)
                                                 OCCURS  5.
               05  SPA-W25-GMN-INPUT             PIC X(22).
               05  SPA-W25-GMN-SYORI             PIC X(01).
               05  SPA-W25-GMN-SYORI2            PIC X(01).
               05  SPA-W25-GMN-SYORI3            PIC X(02).
               05  SPA-W25-NAI-KENSA.
                   07  SPA-W25-NAI-KENSANO       PIC 9(02).
                   07  SPA-W25-NAI-HOUKATU       PIC X(01).
      *
               05  SPA-W25-GMN-TBL.
                   07  SPA-W25-GMN-TBLREC        OCCURS   200.
                       11  SPA-W25-GMN-NO         PIC 9(03).
                       11  SPA-W25-GMN-NO-X       REDEFINES
                           SPA-W25-GMN-NO         PIC X(03).
                       11  SPA-W25-GMN-INPUTCD    PIC X(20).
                       11  SPA-W25-GMN-SRYCD      PIC X(09).
                       11  SPA-W25-GMN-NAME       PIC X(70).
                       11  SPA-W25-GMN-TANI       PIC X(10).
                       11  SPA-W25-GMN-KISOTEN    PIC 9(07)V99.
      *
                       11  SPA-W25-NAI-NO         PIC 9(03).
      *        ¼«±¡ºÎÍÑ
               05  SPA-W25-JIIN-G.
                   07  SPA-W25-JIIN               PIC X(01).
                   07  SPA-W25-JIINF              PIC X(01).
                   07  SPA-W25-JIINMEI            PIC X(18).
               05  SPA-W25-JIIN-COB               OCCURS  10.
                   07  SPA-W25-JIINLST            PIC X(20).
      *
               05  SPA-W25-USER-G.
                   07  SPA-W25-USER               PIC X(01).
                   07  SPA-W25-USERF              PIC X(01).
                   07  SPA-W25-USERMEI            PIC X(18).
               05  SPA-W25-USER-COB               OCCURS  10.
                   07  SPA-W25-USERLST            PIC X(20).
      *    ¿ÇÎÅ¹Ô°Ù¸¡º÷²èÌÌÏ¢Íí¾ðÊó
           03  SPA-W25-AREA.
               07  SPA-W25-CDSYUBETU       PIC X(01).
               07  SPA-W25-INPUTCD         PIC X(22).
               07  SPA-W25-NAIYOU          PIC X(07).
               07  SPA-W25-MOJI            PIC 9(02).
               07  SPA-W25-TYPE            PIC X(01).
      *
               07  SPA-W25-GMN-ALL         PIC X(01).
      *
               07  SPA-W25-SRYCD           PIC X(09).
               07  SPA-W25-NAME            PIC X(60).
      *
               07  SPA-W25-RC              PIC 9(04).
