      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *    °åÎÅµ¡´Ø¾ðÊó¡¼Æþ±¡´ðËÜ²èÌÌ£Ó£Ð£Á    (SPA-FREE ¤ÎÆâÍÆ)
      *  ¥³¥Ô¡¼¶ç½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *****************************************************************
      *
       01  SPA-W24FREE.
      *  °åÎÅµ¡´ØÆþ±¡¾ðÊó²èÌÌ£Ó£Ð£Á
         03  SPA-W24.
           05  SPA-W24-AREA.
             07  SPA-GMN-W24-PAGE                      PIC 9(02).
             07  SPA-GMN-W24-LINE                      PIC 9(02).
             07  SPA-GMN-W24-MAX                       PIC 9(04).
             07  SPA-GMN-W24-CUR                       PIC 9(03).
             07  SPA-GMN-W24-MOTOPG                    PIC X(08).
             07  SPA-GMN-W24-MOTOIDX                   PIC 9(05).
             07  SPA-GMN-W24-AREA.
      *        ÆþÎÏ¹àÌÜÎÎ°è
               09  SPA-GMN-W24-INPUT-AREA.
      *          Í­¸ú³«»ÏÆü
                 11  SPA-GMN-W24-STYUKYMD              PIC X(10).
      *          Í­¸ú½ªÎ»Æü
                 11  SPA-GMN-W24-EDYUKYMD              PIC X(10).
      *
                 11  SPA-GMN-W24-FRAME1.
      *            Æþ±¡»þ¿©»öÎÅÍÜ
                   13  SPA-GMN-W24-SK-NYUSYOKU.
                     15  SPA-GMN-W24-SK-NYUSYOKU-CD    PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SK-NYUSYOKU-NM    PIC X(26).
      *            ÆÃÊÌ´ÉÍý²Ã»»
                   13  SPA-GMN-W24-SK-TOKKSN.
                     15  SPA-GMN-W24-SK-TOKKSN-CD      PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SK-TOKKSN-NM      PIC X(26).
      *            ¿©Æ²²Ã»»
                   13  SPA-GMN-W24-SK-SYOKUDO.
                     15  SPA-GMN-W24-SK-SYOKUDO-CD     PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-SK-SYOKUDO-NM     PIC X(26).
      *
                 11  SPA-GMN-W24-FRAME2.
      *            Æþ±¡¿ÇÎÅ·×²èÌ¤¼Â»Ü¸º»»
                   13  SPA-GMN-W24-GN-NYUSRY.
                     15  SPA-GMN-W24-GN-NYUSRY-CD      PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-GN-NYUSRY-NM      PIC X(26).
      *            ±¡Æâ´¶À÷ËÉ»ßÂÐºöÌ¤¼Â»Ü¸º»»
                   13  SPA-GMN-W24-GN-INKANSEN.
                     15  SPA-GMN-W24-GN-INKANSEN-CD    PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-GN-INKANSEN-NM    PIC X(26).
      *            °åÎÅ°ÂÁ´´ÉÍýÂÎÀ©Ì¤¼Â»Ü¸º»»
                   13  SPA-GMN-W24-GN-ANZEN.
                     15  SPA-GMN-W24-GN-ANZEN-CD       PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-GN-ANZEN-NM       PIC X(26).
      *            êóáìÂÐºöÌ¤¼Â»Ü¸º»»
                   13  SPA-GMN-W24-GN-JOKUSO.
                     15  SPA-GMN-W24-GN-JOKUSO-CD      PIC X(01).
                     15                                PIC X(01).
                     15  SPA-GMN-W24-GN-JOKUSO-NM      PIC X(26).
      *
                 11  SPA-GMN-W24-FRAME3.
      *            Æþ±¡²Ã»»¾ðÊó
                   13  SPA-GMN-W24-CHK-NYUKSN.
                     15 SPA-GMN-W24-CHK-NYUKSN-OCC
                                                       OCCURS 20.
                       17 SPA-GMN-W24-CHK-NYUKSNFLG
                                                       PIC X(01).
                       17 SPA-GMN-W24-CHK-NYUKSNNM     PIC X(01).
                   13  SPA-GMN-W24-NYUKSNNM            PIC X(32)
                                                       OCCURS 20.
      *            13  SPA-GMN-W24-NYUKSNSRYCD         PIC X(09)
      *                                                OCCURS 20.
      *            ÃÏ°è²Ã»»
                   13  SPA-GMN-W24-CHIIKIKSN.
                     15 SPA-GMN-W24-CHIIKIKSN-CD       PIC X(01).
                     15                                PIC X(01).
                     15 SPA-GMN-W24-CHIIKIKSN-NM       PIC X(26).
                   13  SPA-GMN-W24-CHIIKIKSNSRYCD      PIC X(09).
                 11  SPA-GMN-W24-FRAME4.
      *            Æþ±¡²ñ·×É½¼¨¾ðÊó
                   13  SPA-GMN-W24-SRYCD               PIC X(09)
                                                       OCCURS 10.
                   13  SPA-GMN-W24-SRYACT              PIC X(30)
                                                       OCCURS 10.
                 11  SPA-GMN-W24-REKI-DISPKBN.
                   13  SPA-GMN-W24-REKI-DISPKBN-CD     PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-REKI-DISPKBN-NM     PIC X(22).
                 11  SPA-GMN-W24-SKYPRTKBN.
                   13  SPA-GMN-W24-SKYPRTKBN-CD        PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-SKYPRTKBN-NM        PIC X(18).
                 11  SPA-GMN-W24-TAIPRTKBN.
                   13  SPA-GMN-W24-TAIPRTKBN-CD        PIC X(01).
                   13                                  PIC X(01).
                   13  SPA-GMN-W24-TAIPRTKBN-NM        PIC X(18).
      *        ¥³¥ó¥Ü¹àÌÜÎÎ°è
               09  SPA-GMN-W24-CMB-DAT-AREA.
      *          Æþ±¡»þ¿©»öÎÅÍÜ
                 11  SPA-GMN-W24-CMB-SK-NYUSYOKU.
                   13  SPA-GMN-W24-SK-NYUSYOKU-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-SK-NYUSYOKU-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX01.
      *          ÆÃÊÌ´ÉÍý²Ã»»
                 11  SPA-GMN-W24-CMB-SK-TOKKSN.
                   13  SPA-GMN-W24-SK-TOKKSN-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-SK-TOKKSN-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX02.
      *          ¿©Æ²²Ã»»
                 11  SPA-GMN-W24-CMB-SK-SYOKUDO.
                   13  SPA-GMN-W24-SK-SYOKUDO-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-SK-SYOKUDO-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX03.
      *          Æþ±¡¿ÇÎÅ·×²èÌ¤¼Â»Ü¸º»»
                 11  SPA-GMN-W24-CMB-GN-NYUSRY.
                   13  SPA-GMN-W24-GN-NYUSRY-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-GN-NYUSRY-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX04.
      *          ±¡Æâ´¶À÷ËÉ»ßÂÐºöÌ¤¼Â»Ü¸º»»
                 11  SPA-GMN-W24-CMB-GN-INKANSEN.
                   13  SPA-GMN-W24-GN-INKANSEN-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-GN-INKANSEN-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX05.
      *          °åÎÅ°ÂÁ´´ÉÍýÂÎÀ©Ì¤¼Â»Ü¸º»»
                 11  SPA-GMN-W24-CMB-GN-ANZEN.
                   13  SPA-GMN-W24-GN-ANZEN-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-GN-ANZEN-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX06.
      *          êóáìÂÐºöÌ¤¼Â»Ü¸º»»
                 11  SPA-GMN-W24-CMB-GN-JOKUSO.
                   13  SPA-GMN-W24-GN-JOKUSO-CNT
                                                       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-GN-JOKUSO-ITM
                                                       PIC X(28)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX07.
      *          ÃÏ°è²Ã»»
                 11  SPA-GMN-W24-CMB-CHIIKIKSN.
                   13  SPA-GMN-W24-CHIIKIKSN-CNT       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-CHIIKIKSN-ITM-OCC   OCCURS  5
                                           INDEXED BY  CMB-IDX08.
                        15  SPA-GMN-W24-CHIIKIKSN-ITM  PIC X(28).
      *
      *          Æþ±¡ÎòÉ½¼¨
                 11  SPA-GMN-W24-CMB-REKI-DISPKBN.
                   13  SPA-GMN-W24-REKI-DISPKBN-CNT    PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-REKI-DISPKBN-ITM    PIC X(24)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX09.
      *
      *          ÀÁµá½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-CMB-SKYPRTKBN.
                   13  SPA-GMN-W24-SKYPRTKBN-CNT       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-SKYPRTKBN-ITM       PIC X(20)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX10.
      *
      *          Âà±¡¾ÚÌÀ½ñÈ¯¹Ô¶èÊ¬
                 11  SPA-GMN-W24-CMB-TAIPRTKBN.
                   13  SPA-GMN-W24-TAIPRTKBN-CNT       PIC S9(9)
                                                       BINARY.
                   13  SPA-GMN-W24-TAIPRTKBN-ITM       PIC X(20)
                                                       OCCURS  5
                                           INDEXED BY  CMB-IDX11.
      *    ¿ÇÎÅ¹Ô°Ù¸¡º÷²èÌÌ£Ó£Ð£Á
           03  SPA-W25-MOTOPG                    PIC X(08).
           03  SPA-W25GMN-AREA.
               05  SPA-W25-GMN-MAX               PIC 9(03).
               05  SPA-W25-NEXT                  PIC 9(04).
               05  SPA-W25-GMN-CUR               PIC 9(03).
      *
               05  SPA-W25-GMN-SELNUM-G.
                   07  SPA-W25-GMN-SELNUM        PIC X(03)
                                                 OCCURS  5.
               05  SPA-W25-NAI-SELNUM-G.
                   07  SPA-W25-NAI-SELNUM        PIC 9(03)
                                                 OCCURS  5.
               05  SPA-W25-GMN-INPUT             PIC X(22).
               05  SPA-W25-GMN-SYORI             PIC X(01).
               05  SPA-W25-GMN-SYORI2            PIC X(01).
               05  SPA-W25-GMN-SYORI3            PIC X(02).
               05  SPA-W25-NAI-KENSA.
                   07  SPA-W25-NAI-KENSANO       PIC 9(02).
                   07  SPA-W25-NAI-HOUKATU       PIC X(01).
      *
               05  SPA-W25-GMN-TBL.
                   07  SPA-W25-GMN-TBLREC        OCCURS   200.
                       11  SPA-W25-GMN-NO         PIC 9(03).
                       11  SPA-W25-GMN-NO-X       REDEFINES
                           SPA-W25-GMN-NO         PIC X(03).
                       11  SPA-W25-GMN-INPUTCD    PIC X(20).
                       11  SPA-W25-GMN-SRYCD      PIC X(09).
                       11  SPA-W25-GMN-NAME       PIC X(70).
                       11  SPA-W25-GMN-TANI       PIC X(10).
                       11  SPA-W25-GMN-KISOTEN    PIC 9(07)V99.
      *
                       11  SPA-W25-NAI-NO         PIC 9(03).
      *        ¼«±¡ºÎÍÑ
               05  SPA-W25-JIIN-G.
                   07  SPA-W25-JIIN               PIC X(01).
                   07  SPA-W25-JIINF              PIC X(01).
                   07  SPA-W25-JIINMEI            PIC X(18).
               05  SPA-W25-JIIN-COB               OCCURS  10.
                   07  SPA-W25-JIINLST            PIC X(20).
      *
               05  SPA-W25-USER-G.
                   07  SPA-W25-USER               PIC X(01).
                   07  SPA-W25-USERF              PIC X(01).
                   07  SPA-W25-USERMEI            PIC X(18).
               05  SPA-W25-USER-COB               OCCURS  10.
                   07  SPA-W25-USERLST            PIC X(20).
      *    ¿ÇÎÅ¹Ô°Ù¸¡º÷²èÌÌÏ¢Íí¾ðÊó
           03  SPA-W25-AREA.
               07  SPA-W25-CDSYUBETU       PIC X(01).
               07  SPA-W25-INPUTCD         PIC X(22).
               07  SPA-W25-NAIYOU          PIC X(07).
               07  SPA-W25-MOJI            PIC 9(02).
               07  SPA-W25-TYPE            PIC X(01).
      *
               07  SPA-W25-GMN-ALL         PIC X(01).
      *
               07  SPA-W25-SRYCD           PIC X(09).
               07  SPA-W25-NAME            PIC X(60).
      *
               07  SPA-W25-RC              PIC 9(04).
