      *******************************************************************
      * Project code name "ORCA"
      * Æü°åÉ¸½à¥ì¥»¥×¥È¥½¥Õ¥È¡ÊJMA standard receipt software¡Ë
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *****************************************************************
      *
      *    ¥Á¥§¥Ã¥¯¥Þ¥¹¥¿ ²èÌÌ£Ó£Ð£Á 
      *            ²èÌÌ¡¡£Ø£°£±¡¢£Ø£°£²¡¢£Ø£°£³¡¢£Ø£¹£¹
      *****************************************************************
      *****************************************************************
      *  ¥×¥í¥°¥é¥à½¤ÀµÍúÎò
      * Maj/Min/Rev  ½¤Àµ¼Ô       ÆüÉÕ      ÆâÍÆ
      *****************************************************************
       01  SPA-X01FREE.
      *
      *    £Ø£°£³²èÌÌÍÑ
           03  SPA-X03-GMN-AREA.
               05  SPA-X03-GMN-KAKUTEI                 PIC 9(01).
               05  SPA-X03-GMN-NEXT                    PIC 9(01).
               05  SPA-X03-GMN-PAGE                    PIC 9(05).
               05  SPA-X03-GMN-CUR                     PIC 9(03).
               05  SPA-X03-GMN-LCHKKBNMEI              PIC X(20).
               05  SPA-X03-GMN-LYUKOSTYMD              PIC X(09).
               05  SPA-X03-GMN-LYUKOEDYMD              PIC X(09).
               05  SPA-X03-GMN-LNAME                   PIC X(70).
               05  SPA-X03-GMN-LCHKLST.
                   07  SPA-X03-GMN-LCHKLST-MAX         PIC 9(03).
                   07  SPA-X03-GMN-LCHKLST-OCC         OCCURS  100.
                       09  SPA-X03-GMN-TLCHK-NUM       PIC 9(03).
                       09  SPA-X03-GMN-TLCHK-NAME      PIC X(70).
                   07  SPA-X03-GMN-LCHKLST-FLG         PIC 9(01)
                                                       OCCURS  100.
               05  SPA-X03-GMN-RCHKKBNMEI              PIC X(20).
               05  SPA-X03-GMN-RYUKOSTYMD              PIC X(09).
               05  SPA-X03-GMN-RYUKOEDYMD              PIC X(09).
               05  SPA-X03-GMN-RNAME                   PIC X(70).
               05  SPA-X03-GMN-RCHKLST.
                   07  SPA-X03-GMN-RCHKLST-MAX         PIC 9(03).
                   07  SPA-X03-GMN-RCHKLST-OCC         OCCURS  100.
                       09  SPA-X03-GMN-TRCHK-NUM       PIC 9(03).
                       09  SPA-X03-GMN-TRCHK-NAME      PIC X(70).
                   07  SPA-X03-GMN-RCHKLST-FLG         PIC 9(01)
                                                       OCCURS  100.
               05  SPA-X03-GMN-CHKKBN-G.
                   07  SPA-X03-GMN-CHKKBN              PIC X(01).
                   07                                  PIC X(01).
                   07  SPA-X03-GMN-CHKKBNMEI           PIC X(20).
               05  SPA-X03-GMN-CHKKBNLST-G.
                   07  SPA-X03-GMN-CHKKBN-MAX          PIC 9(03).
                   07  SPA-X03-GMN-CHKKBNLST           OCCURS  05.
                       09  SPA-X03-GMN-CHKKBNL         PIC X(01).
                       09                              PIC X(01).
                       09  SPA-X03-GMN-CHKKBNMEIL      PIC X(20).
               05  SPA-X03-GMN-SELNAME                 PIC X(70).
               05  SPA-X03-GMN-SELCHKLST.
                   07  SPA-X03-GMN-SELCHKLST-MAX       PIC 9(03).
                   07  SPA-X03-GMN-SELCHKLST-OCC       OCCURS  100.
                       09  SPA-X03-GMN-TSEL-CHKNUM     PIC 9(03).
                       09  SPA-X03-GMN-TSEL-NAME       PIC X(70).
                       09  SPA-X03-GMN-TSEL-YUKOSTYMD  PIC X(09).
                       09  SPA-X03-GMN-TSEL-YUKOEDYMD  PIC X(09).
                   07  SPA-X03-GMN-SELCHKLST-SEL       PIC 9(05).
               05  SPA-X03-GMN-KJNYMD                  PIC X(10).
           03  SPA-X03-NAI-AREA.
               05  SPA-X03-NAI-LCHKLST.
                   07  SPA-X03-NAI-LCHKLST-OCC         OCCURS  100.
                       09  SPA-X03-NAI-TLCHK-SRYCD     PIC X(09).
               05  SPA-X03-NAI-RYUKOSTYMD              PIC X(08).
               05  SPA-X03-NAI-RYUKOEDYMD              PIC X(08).
               05  SPA-X03-NAI-RCHKLST.
                   07  SPA-X03-NAI-RCHKLST-OCC         OCCURS  100.
                       09  SPA-X03-NAI-TRCHK-SRYCD     PIC X(09).
                       09  SPA-X03-NAI-TRCHK-DELFLG    PIC 9(01).
               05  SPA-X03-NAI-SELCHKLST.
                   07  SPA-X03-NAI-SELCHKLST-KBN       PIC X(01).
                   07  SPA-X03-NAI-SELCHKLST-OCC       OCCURS  100.
                       09  SPA-X03-NAI-TSEL-SRYCD      PIC X(09).
                       09  SPA-X03-NAI-TSEL-YUKOSTYMD  PIC X(08).
                       09  SPA-X03-NAI-TSEL-YUKOEDYMD  PIC X(08).
               05  SPA-X03-NAI-KJNYMD                  PIC X(08).
      *
      *    £Ø£¹£¸²èÌÌÍÑ
           03  SPA-X98-MOTOPG                    PIC X(08).
           03  SPA-X98GMN-AREA.
               05  SPA-X98-GMN-MAX               PIC 9(03).
               05  SPA-X98-NEXT                  PIC 9(04).
               05  SPA-X98-GMN-CUR               PIC 9(03).
      *
               05  SPA-X98-GMN-SELNUM-G.
                   07  SPA-X98-GMN-SELNUM        PIC X(03)
                                                 OCCURS  5.
               05  SPA-X98-NAI-SELNUM-G.
                   07  SPA-X98-NAI-SELNUM        PIC 9(03)
                                                 OCCURS  5.
               05  SPA-X98-GMN-INPUT             PIC X(22).
               05  SPA-X98-GMN-SYORI             PIC X(01).
               05  SPA-X98-GMN-SYORI2            PIC X(01).
               05  SPA-X98-GMN-SYORI3            PIC X(02).
               05  SPA-X98-GMN-KBN               PIC X(01).
               05  SPA-X98-NAI-KENSA.
                   07  SPA-X98-NAI-KENSANO       PIC 9(02).
                   07  SPA-X98-NAI-HOUKATU       PIC X(01).
      *
               05  SPA-X98-GMN-TBL.
                   07  SPA-X98-GMN-TBLREC        OCCURS   200.
                       11  SPA-X98-GMN-NO         PIC 9(03).
                       11  SPA-X98-GMN-NO-X       REDEFINES
                           SPA-X98-GMN-NO         PIC X(03).
                       11  SPA-X98-GMN-INPUTCD    PIC X(20).
                       11  SPA-X98-GMN-SRYCD      PIC X(09).
                       11  SPA-X98-GMN-NAME       PIC X(70).
                       11  SPA-X98-GMN-TANI       PIC X(10).
                       11  SPA-X98-GMN-KISOTEN    PIC 9(07)V99.
      *
                       11  SPA-X98-NAI-NO         PIC 9(03).
      *        ¼«±¡ºÎÍÑ
               05  SPA-X98-JIIN-G.
                   07  SPA-X98-JIIN               PIC X(01).
                   07  SPA-X98-JIINF              PIC X(01).
                   07  SPA-X98-JIINMEI            PIC X(18).
               05  SPA-X98-JIIN-COB               OCCURS  10.
                   07  SPA-X98-JIINLST            PIC X(20).
      *
               05  SPA-X98-USER-G.
                   07  SPA-X98-USER               PIC X(01).
                   07  SPA-X98-USERF              PIC X(01).
                   07  SPA-X98-USERMEI            PIC X(18).
               05  SPA-X98-USER-COB               OCCURS  10.
                   07  SPA-X98-USERLST            PIC X(20).
      *    Â¾¤Î²èÌÌ
           03  SPA-X01SONOTA                  PIC X(30000). 
