        02  XADMY01.
      ***** 02  XADMY01-FIXED1.
              03  XADMY01-PANDAPRINT1.
                04  XADMY01-ITEM     OCCURS  10 TIMES.
                  05  XADMY01-PATH PIC X(256).
                  05  XADMY01-TITLE    PIC X(256).
                  05  XADMY01-SHOWDIALOG   PIC S9(9)   BINARY.
                  05  XADMY01-NRETRY   PIC S9(9)   BINARY.
