        02  XGFIL.
           03 XGFIL-FIXED.
            04  XGFIL-XGFIL1.
              05  XGFIL-OBJECTDATA  PIC X(8).
              05  XGFIL-ENTRY1.
                06 XGFIL-VALUE      PIC X(100).
            04  XGFIL-TITLE         PIC X(100).
            04  XGFIL-KENSU         PIC X(7).

