        02  ZFIL.
           03 ZFIL-FIXED.
            04  ZFIL-ZFIL1.
              05  ZFIL-OBJECTDATA  PIC X(8).
              05  ZFIL-ENTRY1.
                06 ZFIL-VALUE      PIC X(100).
            04  ZFIL-TITLE         PIC X(100).
            04  ZFIL-KENSU         PIC X(7).
