--                       --
-- システム管理          --
-- 入院オーダー確認リスト--
--                       --
-- 2005/12/14            --
--                       --

COPY "tbl_syskanri" FROM stdin;
0043	1009    	00000000	99999999	入院オーダー確認リスト                                                                                                                                          ORCBD009                受付開始日          YMD       受付終了日          YMD       処理区分            PSN1                                                                                                                                                                                                                        221			20051213	20051213	111819
\.
