-- システム管理テーブル
--
-- 保険請求確認リスト
--
-- 作成日 2005/09/30

COPY "tbl_syskanri" FROM stdin;
0044	1019     	00000000	99999999	保険請求確認リスト                                                                                                                                              ORCBG014                請求年月            YM        提出先区分          PSN1      保険者番号          99999999  処理区分            PSN1      入外区分            PSN1      在総診区分          PSN1      レセプト種別        PSN3                                                                                                1222222			20041102	20050930	101010
\.
